РП/src/Enums/ТипыНалогов/ТипыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогов</name>
  <enumValues>
    <name>НДС</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НачисленныйЕСВ</name>
  </enumValues>
  <enumValues>
    <name>ВоенныйСбор</name>
  </enumValues>
  <enumValues>
    <name>Акциз</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ВидыОперацийПоЗарплате/ВидыОперацийПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоЗарплате</name>
  <enumValues>
    <name>АлиментыПрочиеИсполнительныеЛисты</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок</name>
  </enumValues>
  <enumValues>
    <name>ВозмещениеУщерба</name>
  </enumValues>
  <enumValues>
    <name>ВознаграждениеПлатежногоАгента</name>
  </enumValues>
  <enumValues>
    <name>ВыплатыБывшимСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>Депонирование</name>
  </enumValues>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ДобровольныеВзносыВНПФ</name>
  </enumValues>
  <enumValues>
    <name>ДоговорАвторскогоЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ДоговорРаботыУслуги</name>
  </enumValues>
  <enumValues>
    <name>ДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ДСВ</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>НатуральныйДоход</name>
  </enumValues>
  <enumValues>
    <name>НачисленоДоход</name>
  </enumValues>
  <enumValues>
    <name>НачисленоПроцентовПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>НачисленоСдельноДоход</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаЗадержкуЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛРасчетыСБывшимиСотрудниками</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>ОценкаОбязательстваИФормированиеРезервов</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймов</name>
  </enumValues>
  <enumValues>
    <name>Профвзносы</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеУдержания</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифЛЭ</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифШахтеры</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРНакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ПФРДоПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>ПФРПоСуммарномуТарифу</name>
  </enumValues>
  <enumValues>
    <name>ПФРСтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>РасходыПоСтрахованиюБюджет</name>
  </enumValues>
  <enumValues>
    <name>РасходыПоСтрахованиюРаботодатель</name>
  </enumValues>
  <enumValues>
    <name>РасходыПоСтрахованиюФСС</name>
  </enumValues>
  <enumValues>
    <name>РасходыПоСтрахованиюФССНС</name>
  </enumValues>
  <enumValues>
    <name>СписаниеДепонента</name>
  </enumValues>
  <enumValues>
    <name>ТФОМС</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеЗаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеНеизрасходованныхПодотчетныхСумм</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеПоПрочимОперациямСРаботниками</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФССНС</name>
  </enumValues>
  <enumValues>
    <name>ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпускОценочныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>ПФР</name>
  </enumValues>
  <enumValues>
    <name>ФОМС</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпускОценочныеОбязательстваИРезервыБУ</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпускОценочныеОбязательстваИРезервыНУ</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпускОценочныеОбязательстваИРезервы</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпускРезервы</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЕжегодногоОтпуска</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЕжегодногоОтпускаОценочныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>НачислениеЕСВ</name>
  </enumValues>
  <enumValues>
    <name>ВоенныйСбор</name>
  </enumValues>
  <enumValues>
    <name>ВСДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ВСРасчетыСБывшимиСотрудниками</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ТипыНалогов/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивИсключаемыхЗначений = Новый Массив;
	
	Если МассивИсключаемыхЗначений.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОбщегоНазначенияУТВызовСервера.ПолучитьСписокВыбораПеречисления(
			"ТипыНалогов",
			ДанныеВыбора,
			Параметры,
			МассивИсключаемыхЗначений);
		
	КонецЕсли;
	
КонецПроцедуры

//++ НЕ УТ

// Функция возвращает типа налога в зависимости от операции по зарплате.
//
// Параметры:
//   ВидОперации - Перечисление.ВидыОперацийПоЗарплате - вид операции по зарплате
//
// Возвращаемое значение:
//   ТипНалога  -  Перечисление "Типы налогов"
// 
Функция ТипНалогаОперацииПоЗарплаты(ВидОперации) Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛ Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛ;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛДоначисленныйПоРезультатамПроверки Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛДоначисленныйПоРезультатамПроверки;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛДоходыКонтрагентов;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛПередачаЗадолженностиВНалоговыйОрган Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛПередачаЗадолженностиВНалоговыйОрган;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛПрочиеРасчетыСПерсоналом;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛДоходыКонтрагентов;
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НФДЛДивиденды Тогда
        ТипНалога = Перечисления.ТипыНалогов.НФДЛДивиденды;
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НФДЛДивидендыСотрудникам Тогда
        ТипНалога = Перечисления.ТипыНалогов.НФДЛДивидендыСотрудникам;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВоенныйСбор Тогда
		ТипНалога = Перечисления.ТипыНалогов.ВоенныйСбор;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВСДоходыКонтрагентов Тогда
		ТипНалога = Перечисления.ТипыНалогов.ВоенныйСбор;	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВСРасчетыСБывшимиСотрудниками Тогда
		ТипНалога = Перечисления.ТипыНалогов.ВоенныйСбор;	
	КонецЕсли;
	
	Возврат ТипНалога;
	
КонецФункции
//-- НЕ УТ
